In [1]:
import pandas as pd

In [2]:
df = pd.read_html('http://sos.ga.gov/elections/election_results/2006_1107/019.htm')

In [3]:
df = df[0]

In [4]:
df.head(5)

         0    1    2                          3                   4
0      NaN  NaN  NaN  Westmoreland (R)  130,428  McGraw (D)  62,371
1      NaN  NaN  NaN                      67.6%               32.4%
2   County   PR   TP                        NaN                 NaN
3  CARROLL   20   20                       8456                3629
4   COWETA   30   30                      19937                8263

In [5]:
df = df[3:]

In [6]:
df.head(5)

         0   1   2      3      4
3  CARROLL  20  20   8456   3629
4   COWETA  30  30  19937   8263
5  DOUGLAS   8   8   4627   1850
6  FAYETTE  38  38  23633  11841
7   HARRIS  14  14   5371   2206

In [7]:
df = df.drop(df.columns[[1,2]], axis=1)

In [8]:
df.head(5)

         0      3      4
3  CARROLL   8456   3629
4   COWETA  19937   8263
5  DOUGLAS   4627   1850
6  FAYETTE  23633  11841
7   HARRIS   5371   2206

In [9]:
df.columns = ['county', 'Lynn Westmoreland', 'Mike McGraw']

In [10]:
df.tail(5)

      county Lynn Westmoreland Mike McGraw
13      PIKE              3484        1180
14  ROCKDALE              1996        1110
15  SPALDING              8539        4614
16     TROUP              8715        4659
17     UPSON              3658        2038

In [11]:
df = df.melt(id_vars=['county'])

In [12]:
df.columns = ['county', 'candidate', 'votes']

In [13]:
df.head()

    county          candidate  votes
0  CARROLL  Lynn Westmoreland   8456
1   COWETA  Lynn Westmoreland  19937
2  DOUGLAS  Lynn Westmoreland   4627
3  FAYETTE  Lynn Westmoreland  23633
4   HARRIS  Lynn Westmoreland   5371

In [14]:
df['votes'] = df['votes'].astype(int)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
county       30 non-null object
candidate    30 non-null object
votes        30 non-null int64
dtypes: int64(1), object(2)
memory usage: 800.0+ bytes

In [16]:
df['office'] = 'U.S. Representative'

In [17]:
df['district'] = '3'

In [18]:
df['party'] = ''

In [19]:
df.loc[df['candidate'] == 'Lynn Westmoreland', 'party'] = 'Republican'
df.loc[df['candidate'] == 'Mike McGraw', 'party'] = 'Democrat'

In [20]:
df.groupby(['candidate', 'party'])['votes'].sum()

candidate          party
Lynn Westmoreland  Republican    130428
Mike McGraw        Democrat       62371
Name: votes, dtype: int64

In [21]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].head()

    county               office district       party          candidate  votes
0  CARROLL  U.S. Representative        3  Republican  Lynn Westmoreland   8456
1   COWETA  U.S. Representative        3  Republican  Lynn Westmoreland  19937
2  DOUGLAS  U.S. Representative        3  Republican  Lynn Westmoreland   4627
3  FAYETTE  U.S. Representative        3  Republican  Lynn Westmoreland  23633
4   HARRIS  U.S. Representative        3  Republican  Lynn Westmoreland   5371

In [22]:
df[['county', 'office', 'district', 'party', 'candidate', 'votes']].to_clipboard(index=False, sep=',')